/**
 * 介绍：
 * 作者：xjzhao
 * 邮箱：mr.feeling.heart@gmail.com
 * 时间：2023-08-22 15:16
 */

export const MENUES = [
  {
    name: '智慧大屏',
    intro:
      '智慧大屏以可视化大屏方式展示显示当前运营公司下所有车辆的概览信息。行驶热力图展示运营公司所有车辆行驶过的路线，行驶次数越多的地方颜色越深。',
    list: [
      { name: '可视大屏', intro: '可视化大屏显示', router: '/home' },
      { name: '行驶热力图', intro: '行驶轨迹的热力图', router: '1-2' }
    ]
  },
  {
    name: '车辆管理',
    intro:
      '可以通过批量导入或者手动添加的方式将车辆添加在该系统，前晨汽车可直接查看用车数据，历史轨迹回放、驾驶行为分析等数据。有车可通过安装前晨OBU获取相关用车数据。',
    list: [
      { name: '车辆列表', intro: '所有车辆档案', router: '2-1' },
      { name: '添加车辆', intro: '手动录入车辆信息', router: '2-2' },
      { name: '批量添加车辆', intro: '批量添加车辆信息', router: '2-3' },
      { name: '驾驶行为分析', intro: '对司机每日驾驶评分', router: '2-4' },
      { name: '实时状态', intro: '车辆实时状态查询', router: '2-5' },
      { name: '车辆日记', intro: '车辆每日事件记录', router: '2-6' },
      { name: '轨迹回放', intro: '车辆行驶轨迹查询', router: '2-7' },
      { name: '历史数据', intro: '所有车辆历史数据', router: '2-8' }
    ]
  },
  {
    name: '补能管理',
    intro:
      '绑定前晨APP且已允许使用企业充电账户的车辆，可选择企业账户充电。账户的充值流水，每辆车的充电流水等数据均可查询，同时会根据能耗预测车辆实际使用充电费用的偏差并给出预警。',
    list: [
      { name: '充电钱包', intro: '企业充电钱包', router: '3-1' },
      { name: '可用车辆', intro: '使用钱包车辆管理', router: '3-2' },
      { name: '充电流水', intro: '企业充电钱包流水', router: '3-3' },
      { name: '充电偏差', intro: '充电费用偏差', router: '3-4' },
      { name: '购买记录', intro: '购买充电币记录', router: '3-5' },
      { name: '月度报表', intro: '查看每月充电数据', router: '3-6' }
    ]
  },
  {
    name: '售后管理',
    intro:
      '支持同步前晨汽车售后信息，查看售后维修和保养记录等。支持手动添加维修保养记录，方便查看每月售后费用信息。',
    list: [
      { name: '售后记录', intro: '车辆售后明细记录', router: '4-1' },
      { name: '添加售后记录', intro: '手动添加售后信息', router: '4-2' },
      { name: '批量添加记录', intro: '批量导入售后信息', router: '4-3' }
    ]
  },
  {
    name: '发票管理',
    intro:
      '系统内的消费，如企业充电币充值等，可在消费流水页面申请开发票，发票管理页面查看开票状态及最终发票等。',
    list: [{ name: '发票列表', intro: '在线申请发票记录', router: '5-1' }]
  },
  {
    name: '账号管理',
    intro: '管理员账号会有该功能，用于维护角色，管理子账号。',
    list: [
      { name: '角色管理', intro: '维护账号下的角色', router: '6-1' },
      { name: '账号列表', intro: '管理子账号信息', router: '6-2' }
    ]
  }
]
